#ifndef DEFINES
#define DEFINES

/*
 * ядра свёрток
 */

double const kernelBlur[3][3] = {
    {1.0 / 9.0, 1.0 / 9.0, 1.0 / 9.0},
    {1.0 / 9.0, 1.0 / 9.0, 1.0 / 9.0},
    {1.0 / 9.0, 1.0 / 9.0, 1.0 / 9.0}
};

double const kernelSharpness[3][3] = {
    {-1.0 / 9.0, -1.0 / 9.0, -1.0 / 9.0},
    {-1.0 / 9.0, 17.0 / 9.0, -1.0 / 9.0},
    {-1.0 / 9.0, -1.0 / 9.0, -1.0 / 9.0}
};

double const kernelSobelX[3][3] = {
    {-1.0, 0.0, 1.0},
    {-2.0, 0.0, 2.0},
    {-1.0, 0.0, 1.0}
};

double const kernelSobelY[3][3] = {
    {-1.0,-2.0,-1.0},
    { 0.0, 0.0, 0.0},
    { 1.0, 2.0, 1.0}
};


/*
 * дескрипторы
 */

int const nBin = 36;                    //кол-во корзин для одной части дескриптора
int const nGistBin = 4;                //кол-во гистограмм для дескриптора
int const wGist = 4;                   //ширина гистограммы
int const hGist = 4;                   //высота гистограммы

#endif // DEFINES

